In [3]:
import pandas as pd
import numpy as np
import matplotlib as plt
import seaborn as sns

In [39]:
df = pd.read_csv("Movies/Data Files/Uber Drives 2016.csv")
df.shape
df.head()
df.tail()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

In [40]:
df.describe()

             MILES*
count   1156.000000
mean      21.115398
std      359.299007
min        0.500000
25%        2.900000
50%        6.000000
75%       10.400000
max    12204.700000

In [42]:
#transpose the data
dfT = df.transpose()
dfT

,0,1,2,3,4,5,6,7,8,9,...,1146,1147,1148,1149,1150,1151,1152,1153,1154,1155
START_DATE*,1/1/2016 21:11,1/2/2016 1:25,1/2/2016 20:25,1/5/2016 17:31,1/6/2016 14:42,1/6/2016 17:15,1/6/2016 17:30,1/7/2016 13:27,1/10/2016 8:05,1/10/2016 12:17,...,12/30/2016 11:31,12/30/2016 15:41,12/30/2016 16:45,12/30/2016 23:06,12/31/2016 1:07,12/31/2016 13:24,12/31/2016 15:03,12/31/2016 21:32,12/31/2016 22:08,Totals
END_DATE*,1/1/2016 21:17,1/2/2016 1:37,1/2/2016 20:38,1/5/2016 17:45,1/6/2016 15:49,1/6/2016 17:19,1/6/2016 17:35,1/7/2016 13:33,1/10/2016 8:25,1/10/2016 12:44,...,12/30/2016 11:56,12/30/2016 16:03,12/30/2016 17:08,12/30/2016 23:10,12/31/2016 1:14,12/31/2016 13:42,12/31/2016 15:38,12/31/2016 21:50,12/31/2016 23:51,NaN
CATEGORY*,Business,Business,Business,Business,Business,Business,Business,Business,Business,Business,...,Business,Business,Business,Business,Business,Business,Business,Business,Business,NaN
START*,Fort Pierce,Fort Pierce,Fort Pierce,Fort Pierce,Fort Pierce,West Palm Beach,West Palm Beach,Cary,Cary,Jamaica,...,Kar?chi,Kar?chi,Kar?chi,Kar?chi,Kar?chi,Kar?chi,Unknown Location,Katunayake,Gampaha,NaN
STOP*,Fort Pierce,Fort Pierce,Fort Pierce,Fort Pierce,West Palm Beach,West Palm Beach,Palm Beach,Cary,Morrisville,New York,...,Kar?chi,Kar?chi,Kar?chi,Kar?chi,Kar?chi,Unknown Location,Unknown Location,Gampaha,Ilukwatta,NaN
MILES*,5.1,5,4.8,4.7,63.7,4.3,7.1,0.8,8.3,16.5,...,2.9,4.6,4.6,0.8,0.7,3.9,16.2,6.4,48.2,12204.7
PURPOSE*,Meal/Entertain,NaN,Errand/Supplies,Meeting,Customer Visit,Meal/Entertain,Meeting,Meeting,Meeting,Customer Visit,...,Errand/Supplies,Errand/Supplies,Meeting,Customer Visit,Meeting,Temporary Site,Meeting,Temporary Site,Temporary Site,NaN

In [43]:
df.loc[0:3]

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting

In [57]:
df.sort_index(axis = 1, ascending=True)

,CATEGORY*,END_DATE*,MILES*,PURPOSE*,START*,START_DATE*,STOP*
0,Business,1/1/2016 21:17,5.1,Meal/Entertain,Fort Pierce,1/1/2016 21:11,Fort Pierce
1,Business,1/2/2016 1:37,5.0,NaN,Fort Pierce,1/2/2016 1:25,Fort Pierce
2,Business,1/2/2016 20:38,4.8,Errand/Supplies,Fort Pierce,1/2/2016 20:25,Fort Pierce
3,Business,1/5/2016 17:45,4.7,Meeting,Fort Pierce,1/5/2016 17:31,Fort Pierce
4,Business,1/6/2016 15:49,63.7,Customer Visit,Fort Pierce,1/6/2016 14:42,West Palm Beach
...,...,...,...,...,...,...,...
1151,Business,12/31/2016 13:42,3.9,Temporary Site,Kar?chi,12/31/2016 13:24,Unknown Location
1152,Business,12/31/2016 15:38,16.2,Meeting,Unknown Location,12/31/2016 15:03,Unknown Location
1153,Business,12/31/2016 21:50,6.4,Temporary Site,Katunayake,12/31/2016 21:32,Gampaha
1154,Business,12/31/2016 23:51,48.2,Temporary Site,Gampaha,12/31/2016 22:08,Ilukwatta
1155,NaN,NaN,12204.7,NaN,NaN,Totals,NaN

In [64]:
df.loc[:, ['START*','STOP*']]

                START*             STOP*
0          Fort Pierce       Fort Pierce
1          Fort Pierce       Fort Pierce
2          Fort Pierce       Fort Pierce
3          Fort Pierce       Fort Pierce
4          Fort Pierce   West Palm Beach
...                ...               ...
1151           Kar?chi  Unknown Location
1152  Unknown Location  Unknown Location
1153        Katunayake           Gampaha
1154           Gampaha         Ilukwatta
1155               NaN               NaN

[1156 rows x 2 columns]

In [66]:
df.fillna(value="XXXXX")

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,XXXXX
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
...,...,...,...,...,...,...,...
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,XXXXX,XXXXX,XXXXX,XXXXX,12204.7,XXXXX